** Example 'ACCEPTX5': ACCEPT IF ... LES THAN ...
************************************************************************
DEFINE DATA LOCAL
1 #I(N2) CONST<2>
1 EMPLOY-VIEW VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 NAME
  2 DEPT
  2 JOB-TITLE
END-DEFINE
FORMAT LS=133
FORMAT(2) LS=133
*
READ EMPLOY-VIEW BY DEPT 
  WHERE CITY = 'BARCELONA'
  DISPLAY NOTITLE PERSONNEL-ID NAME DEPT JOB-TITLE 
  DISPLAY(2) *ISN PERSONNEL-ID NAME DEPT JOB-TITLE 
END-READ
END
