DEFINE DATA LOCAL
1 MYCARS VIEW OF CARS
  2 MAKE
  2 MODEL
  2 COLOR
1 #BEGIN    (A2) INIT <'AB'>
1 #END      (A2) INIT <'DE'>
1 #RESPONSE (I4) 
1 #RESULT   (I4) 
1 #MAKE(A20)
END-DEFINE
CALLDBPROC 'CARS_PROC' CARS #BEGIN #END #MAKE 
     RESULT SETS #RESULT
     GIVING #RESPONSE
  
*  READ RESULT SET #RESULT INTO #MAKE FROM MYCARS
*      GIVING #RESPONSE
*    DISPLAY #MAKE
*  END-RESULT
END
