*
* VERY SIMPLE SUBPROGRAM TO TEST ADS ROUTINE AS WEB SERVICE
* RECEIVE TWO NUMBERS AND RETURN THE SUM
*
DEFINE DATA
PARAMETER
1 #N1 (N2)  (AD=A) /* INPUT
1 #N2 (N2)  (AD=A) /* INPUT
1 #R  (N4)  (AD=O) /* OUTPUT
LOCAL
1 #N3 (N3)
1 #N4 (N4)
END-DEFINE
MOVE #N1 TO #N3
MOVE #N2 TO #N4
COMPUTE #R = #N1 + #N2
END
