*
* VERY SIMPLE PROGRAM TO TEST CALL SUBPROGRAM
*
DEFINE DATA
LOCAL
1 #N1 (N2)  /* (AD=A) /* INPUT 
1 #N2 (N2)  /* (AD=A) /* INPUT
1 #N3 (N3)  /* (AD=A) 
1 #N4 (N4)  /* (AD=A) 
1 #R  (N4)  /* (AD=O) /* OUTPUT
END-DEFINE
FORMAT ZP=ON
MOVE 12 TO #N1
REPEAT
INPUT 'Enter two numbers! ->:' #N1  #N2
IF #N1 = 0 ESCAPE BOTTOM END-IF 
CALLNAT 'ADSNMUL' #N1 #N2 #R
MOVE #N1 TO #N3
MOVE #N2 TO #N4
WRITE 'RESULT: ' #N1 '+' #N2 '=' #R
END-REPEAT
END
