* 
* included comments here
*
define data local
1 EMP VIEW OF EMPLOYEES
2 NAME
2 SEX
2 CITY
2 DEPT
1 #C(N3)
END-DEFINE
FORMAT ZP=ON
F1. FIND EMP WITH PERSONNEL-ID = 12345
IF NO RECORDS FOUND 
  ENTER
  /*IGNORE
END-NOREC
WRITE *NUMBER(F1.)
END-FIND
WRITE 'END OF PROGRAM'
END
