DEFINE DATA LOCAL
1 #ARR(A2/10)
END-DEFINE
SET KEY ALL
REPEAT
 INPUT (AD=MI'_') #ARR(*)
 IF *PF-KEY='PF3' ESCAPE BOTTOM END-IF
 IF #ARR(*) = ' '
   WRITE 'ARR(*) = BLANK'
 END-IF
 IF NOT #ARR(*) = ' '
   WRITE 'NOT #ARR(*) = BLANK'
 END-IF
 IF NOT #ARR(*) ¬= ' '  /* ¬= ' '
   WRITE 'NOT #ARR(*) NE BLANK'
 END-IF
END-REPEAT
WRITE 'END OF PROGRAM'
END
