DEFINE DATA LOCAL
1 #ARR (N13/10)
1 #B (N13)
1 #C(N13)
END-DEFINE
FORMAT ZP=ON
SET KEY PF3 = 'HELLO'
REPEAT
MOVE 1 TO #ARR(1)
MOVE 10 TO #B
* ADD #ARR(*) TO #C
SUBTRACT #ARR(*) FROM #B
COMPUTE #C = #ARR(*) + 0
DISPLAY #B #C
END-REPEAT
END
