DEFINE DATA LOCAL  
1 #US(A8)  
END-DEFINE
MOVE 1 TO *LANGUAGE
ASSIGN *ERROR-TA = 'NFWERRTA'
* ASSIGN *USER = 'ZZZ' /* ERROR
MOVE 'XXX' TO #US
* MOVE 'YYY' TO *USER /* ERROR
* MOVE #US TO *USER /* ERROR
MOVE *USER TO #US
INPUT *USER #US
DISPLAY *USER #US
END
