* TESTE CALC7
* VALIDA FUNC TRUNC QUANDO EXPRESSAO SIMPLES 
* VAR = TRUNC(N. EXPR)
DEFINE DATA
LOCAL
1 #A(N8.2)
1 #B(I2)
1 #C(N3.4)
END-DEFINE
ASSIGN #B = 3
ASSIGN #C = 123.123
/*
COMPUTE #A = #B / 4 * 10
DISPLAY #A #B #C
/*
COMPUTE #A = #C / 10 * 100
DISPLAY #A #B #C
/*
COMPUTE #A = #B / 4
DISPLAY #A #B #C
/*
COMPUTE #A = #C / 10
DISPLAY #A #B #C
END



