DEFINE DATA LOCAL
1 EMP VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 INCOME 
    3 CURR-CODE (1:5)
    3 SALARY (1:1)
*
END-DEFINE
*
SET KEY CLR PF3 PA1
R1. READ EMP BY PERSONNEL-ID STARTING FROM '1'
* WRITE "=" PERSONNEL-ID CURR-CODE(*) SALARY(*)
  INPUT USING MAP 'EMPM1'
  INPUT USING MAP 'EMPM1' EMP.CURR-CODE(1:5) EMP.PERSONNEL-ID EMP.SALARY(1)
  IF *PF-KEY EQ 'CLR' or ='PF3'
    ESCAPE BOTTOM
  END-IF
END-READ
END
  
