DEFINE DATA LOCAL
1 EMP VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 INCOME 
    3 CURR-CODE (1:5)
    3 SALARY (1:1)
*
END-DEFINE
*
LIMIT 20
SET KEY ALL
R1. READ EMP /* WITH REPOSITION 
   BY PERSONNEL-ID STARTING FROM '1'
* WRITE "=" PERSONNEL-ID CURR-CODE(*) SALARY(*)
  DISPLAY EMP.PERSONNEL-ID CURR-CODE(1) EMP.SALARY(1)
  IF *PF-KEY EQ 'CLR' or ='PF3'
    ESCAPE BOTTOM
  END-IF
  IF *PF-KEY EQ 'PF5'
    ESCAPE TOP REPOSITION
  END-IF
END-READ
END
  
