DEFINE DATA
LOCAL
1 MYVIEW VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 NAME
  2 CITY
  2 COUNTRY
  2 JOB-TITLE
  2 SALARY (1:1)
1 VEH VIEW OF VEHICLES
  2 PERSONNEL-ID
  2 MAKE
  2 MODEL
  2 COLOR
END-DEFINE  
READ MYVIEW BY NAME
WRITE MYVIEW
FIND VEH WITH MAKE='FORD' AND PERSONNEL-ID = PERSONNEL-ID
WRITE' OK'
END-FIND
END-READ
WRITE 'END OF PROGRAM'
END
