DEFINE DATA
LOCAL
 1 #FIELD_0 (N005)
 1 #FIELD_1 (N005)
 1 #FIELD_2 (A050)
 1 #FIELD_3 (A050)
END-DEFINE
SET KEY ALL
REPEAT
  INPUT USING MAP 'FBM001'
  IF *PF-KEY = 'PF3'
    ESCAPE BOTTOM
  END-IF
END-REPEAT
END
