define data local
1 EMP VIEW OF EMPLOYEES
2 NAME
2 SEX
2 CITY
2 DEPT
2 INCOME(1:3)
  3 SALARY
  3 BONUS(1)
1 #C(N3)
END-DEFINE
FORMAT ZP=ON
LIMIT 2
F1. FIND EMP WITH CITY = 'MADRID' AND SEX = 'F' AND SALARY > 0
  WRITE CITY(F1.) NAME SEX
  MOVE 'F' TO SEX
  UPDATE (F1.)
  /* DELETE (F1.)
END-FIND
END
