DEFINE DATA
LOCAL
 1 #CV0 (C)
 1 #CV1 (C)
 1 #FIELD_0 (N005) INIT <1>
 1 #FIELD_1 (A005) INIT <'AA'>
END-DEFINE
SET KEY ALL
REPEAT
  INPUT USING MAP 'FRMCV'
  IF *PF-KEY = 'PF3'
    ESCAPE BOTTOM
  END-IF
  IF #CV0 MODIFIED
    WRITE 'CV0'
  END-IF
  IF #CV1 MODIFIED
    WRITE 'CV1'
  END-IF
END-REPEAT
END
