DEFINE DATA LOCAL
1 EMP VIEW OF EMPLOYEES
2 PERSONNEL-ID
END-DEFINE
LIMIT 10
RD. READ EMP BY PERSONNEL-ID
AT BREAK OF PERSONNEL-ID
   ESCAPE BOTTOM (RD.) 
END-BREAK
END-READ
END
