DEFINE DATA LOCAL
1 EMP VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 PHONE
  2 REDEFINE PHONE
    3 PHONE_01 (N3)
    3 PHONE_02 (N2)
  2 REDEFINE PHONE
    3 PHONE_03 (N4)
1 #PERSONNEL-ID (A8)
1 #PHONE_03 (N4)
END-DEFINE
LIMIT 20
READ EMP BY NAME
  DISPLAY PERSONNEL-ID PHONE
END-READ
INPUT #PERSONNEL-ID #PHONE_03
FIND EMP PERSONNEL-ID = #PERSONNEL-ID
  WHERE PHONE_03 = #PHONE_03
  DISPLAY PERSONNEL-ID PHONE
END-FIND
END
