define data local
1 EMP VIEW OF EMPLOYEES
2 NAME
2 SEX
2 CITY
2 DEPT
1 #C(N3)
END-DEFINE
FORMAT ZP=ON
R1. READ(30) EMP BY CITY STARTING FROM 'B'
IF BREAK OF CITY 
  WRITE 'BREAK' OLD(CITY) CITY
  ADD 1 TO #C
END-IF
DISPLAY *ISN CITY
END-READ
WRITE #C
END
