DB: 147   FILE: 100  - ISP-INCORE-REPORT                  DEFAULT SEQUENCE:
TYPE: INCORE

T L DB Name                              F Leng  S D Remark
- - -- --------------------------------  - ----  - - ------------------------
*      Generated at 93-10-08 09:49:07
*      from user GMT
  1 A1 LINE                              A 132     D
  1 RN RECORD-NUMBER                     N 7.0   N D
******DDM OUTPUT TERMINATED******
