define data local
1 #V1 (D)
1 #V2 (D)
1 #ND (I4)
end-define
MOVE EDITED '20170330' TO #V1(EM=YYYYMMDD)
MOVE *DATX TO #V2
REPEAT
INPUT (AD=MI) 
  ////'ENTER DATE 1:' #V1(EM=DDMMYYYY)
  ////'ENTER DATE 2:' #V2(EM=YYYYMMDD)
COMPUTE #ND = #V1 - #V2
write 'DAYS:' #ND (ZP=ON)
IF #ND=0 ESCAPE BOTTOM END-IF
END-REPEAT
end




