0010DEFINE DATA
0020LOCAL
00301 #WOR_STR (1:5)
0040  2 #WOR_EXSEP_CD_EMPR (N7) init (2:3) <123>
0050  2 #WOR_EXSEP_CD_ORG (A4)  init (2:3) <'abab'>
00601 #AWOR_STR
0070  2 #AWOR_EXSEP_CD_EMPR (N7)
0080  2 #AWOR_EXSEP_CD_ORG (A4)
00901 #I (I4)
0100END-DEFINE
0110include incprog
0120for #i 1 to 3
0130MOVE BY POSITION #WOR_STR (#i) to #AWOR_STR
0140WRITE '=' #AWOR_EXSEP_CD_EMPR
0150   '=' #AWOR_EXSEP_CD_ORG '=' #i
0160end-for
0170END
