DEFINE DATA 
PARAMETER
1 #NUMBER(N2)
1 #RESULT(N8)
LOCAL
1 #INTER(N2)
END-DEFINE
IF #NUMBER > 1
  COMPUTE #INTER = #NUMBER - 1
  CALLNAT 'NFAT' #INTER #RESULT
ELSE 
  ASSIGN #RESULT = 1
END-IF
WRITE ' = ' #NUMBER ' * ' #RESULT
COMPUTE #RESULT = #NUMBER * #RESULT
END
