DEFINE DATA
 GLOBAL USING GAIV
LOCAL
1 #LVAR(A10)
* INDEPENDENT
* 1 +IAIV(A10/2)
END-DEFINE
WRITE 'ISTO EH GAIV:' &GAIV
WRITE 'ISTO EH IAIV:' &IAIV
WRITE 'ISTO EH IAIV:' &IAIV
WRITE 'ISTO EH +AIV1:' &AIV1
WRITE 'ISTO EH +AIV2:' &AIV2
PRINT +GAIV(*) #LVAR +IAIV(*)
END
