DEFINE DATA LOCAL
 1 #A (A005) INIT<'OLA'> (EM=X^X^X^X^X HD='HELLO')
 1 #B (A005)
 1 #C (N005)INIT<12345> (EM=ZZ,999 HD='NUMBER')
END-DEFINE
INPUT (AD=MI) #A #B #C
WRITE #A #B #C
INPUT USING MAP 'MAP1'
END
