* Program PR1155 in CTZ5484
DEFINE DATA LOCAL
1 USX-MASTER-RGSTR VIEW EMPLOYEES
  2 NAME
  2 PERSONNEL-ID
END-DEFINE
WRITE 'OLA'
READ(5) USX-MASTER-RGSTR BY NAME STARTING FROM 'XY109B2'
 END DATA
   WRITE 'OUT OF DATA'
   ESCAPE BOTTOM IMMEDIATE
 END-ENDDATA
WRITE 'BEFORE BREAK doing some program logic' NAME
*
PERFORM BREAK PROCESSING
AT BREAK OF NAME
   WRITE 'BREAK'  OLD(NAME)
  END-BREAK
*
END-READ
* RESET NAME
WRITE 'RIGHT AFTER READ'
END
