DEFINE DATA LOCAL
01 #LOGICAL (L)
01 #L2      (L) (EM=NO/YES)
01 #B(B1) INIT <H'01'>
01 #A(A1) INIT <'X'>
END-DEFINE
*
MOVE H'00' TO #LOGICAL /* OK
MOVE TRUE TO #L2       /* OK
MOVE H'FF' TO #LOGICAL /* OK
MOVE H'00' TO #L2      /* OK
* MOVE #B TO #L2 /* NOT VALID
* MOVE #A TO #L2 /* NOT VALID
* MOVE 'FALSE' TO #LOGICAL /* NOT VALID
WRITE '=' #LOGICAL #L2
*
END
