DEFINE DATA LOCAL
  1 EMPLOYEES VIEW OF EMPLOYEES
    2 PERSONNEL-ID  
    2 LANG(1:2)
    2 INCOME (1:4) 
      3 BONUS (1:3) 
    2 ADDRESS-LINE(3:3)
END-DEFINE
PASSW='ADS'
FIND EMPLOYEES PERSONNEL-ID ='50005800'
*   IF CURR-CODE(3) = ' '
    WRITE 'ABC' LANG(2) ADDRESS-LINE(3)
*   END-IF
END-FIND
DEFINE SUBROUTINE SUB1
* ASSIGN SALARY(2) = 33
ASSIGN BONUS(1,1) = 1000
END-SUBROUTINE
END
