DB: 000   FILE: 001  - PRODUCTSUPPLIER                    DEFAULT SEQUENCE:
TYPE: SQL

T L DB Name                              F Leng  S D Remark
- - -- --------------------------------  - ----  - - ------------------------
  1 AA PID                               A 10
  1 AB L@PID                             I 2
  1 AC SID                               A 10
  1 AD L@SID                             I 2
******DDM OUTPUT TERMINATED******
