** PR0192   AD=D BECOMES AD=V IN VTAM
DEFINE DATA LOCAL
1 #NORM (A8) INIT<'NORMAL'>
1 #INTS (A8) INIT<'INTENSE'>
END-DEFINE

* INPUT (IP=OFF ZP=OFF PS=24 SG=OFF AD=TOIL'_')
INPUT (AD=OI)
    / #NORM (AD=D)
    / #INTS (AD=I)
END

