DEFINE DATA LOCAL
1 EMPLOYEES VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 NAME
  2 SEx
  2 CITY
  2 INCOME(1:2)
    3 SALARY
    3 BONUS(1:3)
END-DEFINE
*
* STRUCTURED MODE
*
R1. READ EMPLOYEES BY CITY = 'BARCELONA'
  WHERE SEX = 'F'
  /*
  F1. FIND FIRST EMPLOYEES WITH PERSONNEL-ID = PERSONNEL-ID(R1.)
    DISPLAY NAME(F1.) 
  /*
  INPUT(AD=OI) NAME SEX CITY(R1.)  BONUS(1,1) SALARY(1)  BONUS(R1./1,1) SALARY(R1./1)
LOOP
WRITE 'END OF PROGRAM'
END 
