DEFINE DATA LOCAL
  1 I (N23)
  1 J (N23)
     
  1 EMPLOY-H VIEW OF EMPLOYEES
    2 CURRENCY-SALARY 
END-DEFINE
PROCESS SQL TABLES << SET CURRENT SQLID='ADS' >>
H1. HISTOGRAM EMPLOY-H FOR CURRENCY-SALARY
  WRITE *NUMBER *COUNTER CURRENCY-SALARY
END-HISTOGRAM
WRITE 'FIM'
END
