** Example 'ACCEPX04': ACCEPT IF ... LES THAN ...
************************************************************************
DEFINE DATA LOCAL
1 #I(N2) CONST<1>
1 EMPLOY-VIEW VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 NAME
  2 DEPT
  2 JOB-TITLE
  2 ADDRESS-LINE(1:3)
  2 CURR-CODE (1:5)
  2 SALARY    (1:5)
  2 BONUS  (1:5,1:4)
END-DEFINE
*
LIMIT 30
READ EMPLOY-VIEW BY LEAVE-LEFT 
  STORE EMPLOY-VIEW
END-READ
END
