** Example 'TXTEXTEN': CALLING SUBPROGRAM SRXFEXT IN A LOOP
***********************************************************************
DEFINE DATA LOCAL
1 #A(A15)
1 #B(A70)
END-DEFINE
SET KEY ALL
SET KEY PF5 = 'FIN' NAMED 'FIN'
SET KEY PF3 NAMED 'EXIT'
REPEAT
  INPUT 'ENTRE COM O VALOR A GERAR POR EXTENSO: ' #A
  IF *PF-KEY = 'PF3' THEN
    ESCAPE BOTTOM
  END-IF  
  CALLNAT 'SRXFEXT' #A #B
  WRITE #B
END-REPEAT
END
