DEFINE DATA LOCAL
1 #RECORD (A50) 
END-DEFINE
* * 
INPUT 'TECLE <ENTER> PARA INICIO DO UPLOAD'
/// 'work file 6 assinalado como TRANSFER?'
* * 
* * todas as opcoes abaixo tem o mesmo resultado
* * UPLOAD PC FILE 6 #RECORD
* * READ PC FILE 6 #RECORD
READ WORK FILE 6 #RECORD
  WRITE #RECORD
* WRITE(3) NOTITLE  #RECORD
  WRITE PC FILE 15 #RECORD
END-WORK
CLOSE WORK FILE 15
CLOSE WORK FILE 6
* CLOSE PRINTER (3)
WRITE "FIM NORMAL DO PROGRAMA"
INPUT 'FIM'
END





