DEFINE DATA
* GLOBAL USING GBLOCK WITH B1.B3.B4 
 GLOBAL USING GBLOCK  WITH B1.B3.B4
*  GLOBAL USING GBLOCK WITH B1.B2
GLOBAL 
1 +VAR (A10)
LOCAL USING XX16
LOCAL 
  1 #B2-1(A1)
  1 #B2-2(A1)
*  1 #B3-1(A1)
*  1 #B3-2(A1)
* 1 #B4-1(A1)
* 1 #B4-2(A1)
END-DEFINE    
* WRITE +VAR #L #C #USER #DATE
INPUT (AD=MI) 'OI' 
 / #B1-1 
 / #B1-2
 / #B2-1
 / #B2-2
 / B3.#B3-1
 / B31.#B3-2
 / B32.#B3-1
 / B32.#B3-2
 / B4.#B4-1R
 / #B4-2
RESET B3.#B3-1

END
