DEFINE DATA
LOCAL
1 EMPLOY-H1 VIEW OF EMPLOYEES
  2 CITY

1 EMPLOY-H2 VIEW OF EMPLOYEES
  2 NAME

1 EMPLOY-H3 VIEW OF EMPLOYEES
  2 NAME 

1 EMPLOY-H4 VIEW OF EMPLOYEES
  2 NAME 
  
1 EMPLOY-H5 VIEW OF EMPLOYEES
  2 CURRENCY-SALARY(1)

1 #ORDER (A1) INIT <'A'>
END-DEFINE
* *
* * Busca simples por descritor null suppress
H1. HISTOGRAM EMPLOY-H1 FOR CITY
   WRITE 'H1' *COUNTER *NUMBER *ISN CITY
END-HISTOGRAM
*
* Busca simples por descritor null suppress com starting
H1a. HISTOGRAM EMPLOY-H1 FOR CITY STARTING FROM 'BOSTON'
   WRITE 'H1a' *COUNTER *NUMBER *ISN CITY
END-HISTOGRAM
*
* Busca simples por descritor null suppress com crit�rio
H1b. HISTOGRAM EMPLOY-H1 FOR CITY /* STARTING FROM 'BOSTON'
   WHERE CITY < 'DALAS'
   WRITE 'H1b' *COUNTER *NUMBER *ISN CITY
END-HISTOGRAM
*
* Busca simples por descritor default suppresion
H2. HISTOGRAM EMPLOY-H2 FOR NAME
   WRITE 'H2' *COUNTER *NUMBER *ISN NAME
END-HISTOGRAM
*
* Busca simples por descritor descending order
H2a. HISTOGRAM EMPLOY-H2 IN DESC SEQUENCE FOR NAME
   WRITE 'H2a' *COUNTER *NUMBER *ISN NAME
END-HISTOGRAM
*
* * * Busca simples por descritor DYNAMIC order
* * H2b. HISTOGRAM EMPLOY-H2 IN DYNAMIC #ORDER SEQUENCE FOR NAME
* *    WRITE 'H2b' *COUNTER *NUMBER *ISN NAME
* * END-HISTOGRAM
* * * Busca simples por descritor VARIABLE order
* * H2b. HISTOGRAM EMPLOY-H2 IN VARIABLE #ORDER SEQUENCE FOR NAME
* *    WRITE 'H2b' *COUNTER *NUMBER *ISN NAME
* * END-HISTOGRAM
*
* Busca com limite (1)
H3. HISTOGRAM(1) EMPLOY-H3 FOR NAME
   WRITE 'H3' *COUNTER *NUMBER *ISN NAME
END-HISTOGRAM
*
* Busca com limite (1) descending order
H3a. HISTOGRAM(1) EMPLOY-H3 DESCENDING FOR NAME
   WRITE 'H3a' *COUNTER *NUMBER *ISN NAME
END-HISTOGRAM
*
* Busca com limite (10)
H4. HISTOGRAM(10) EMPLOY-H4 FOR NAME
   WRITE 'H4' *COUNTER *NUMBER *ISN NAME
END-HISTOGRAM
*
* Busca com super composto de campo de tabela filha
H5. HISTOGRAM(100) EMPLOY-H5 FOR CURRENCY-SALARY
WRITE 'H5' *COUNTER *NUMBER *ISN CURRENCY-SALARY(*)(EM=HHHHHHHH)
END-HISTOGRAM
*
END
