DEFINE DATA
LOCAL
1 #CAMPO1 (P5)
1 #CAMPO2 (A10)
1 #CAMPO3 (A5)
1 #TXT(A20) INIT <'MENSAGEM'>
END-DEFINE
INPUT  (AD=M )   /* 'MS=ON'
/ #CAMPO1 (IP=OFF)
/ #CAMPO2 /*(MS=OFF) '(MS=OFF)'
/ #CAMPO3 /*(MS=ON)  '(MS=ON)'
INPUT  (AD=M IP=OFF) /* 'MS=OFF'
/ #CAMPO1 (IP=ON)
/ #CAMPO2 /*(MS=OFF) '(MS=OFF)'
/ #CAMPO3 /*(MS=ON)  '(MS=ON)'
INPUT WITH TEXT #TXT MARK *#CAMPO2
/ #CAMPO1 
/ 'OLA:' #CAMPO2 
/ #CAMPO3 

END
