DEFINE DATA LOCAL
1 #CAMPO1(A10) INIT < 'AAAAAAAAAA'>
1 #CAMPO2(A10) INIT < 'BBBBBBBBBB'>
1 #CAMPO3 (N5) INIT < 12345>
1 #I (N2)
END-DEFINE
INPUT 'OI'
DOWNLOAD PC FILE 16 COMMAND 'SET PCFILE 15 DOWN DATA DATA.TXT'
FOR #I = 1 TO 15
WRITE #I #CAMPO1 #CAMPO2 #CAMPO3
/* WRITE(15) 'REP ' #I #CAMPO1 #CAMPO2 #CAMPO3
DOWNLOAD PC FILE 15 #I #CAMPO1 #CAMPO2 #CAMPO3
END-FOR
CLOSE PC FILE 15
write 'FIM DO PROGRAMA'
INPUT 'ENTER'
END
