DEFINE DATA LOCAL  
1 #N1(N2)
1 #N2(N2)
1 #W(A20)
1 #W1(A20/3)
1 #W2(N2/5)
END-DEFINE  
FORMAT SG=OFF IP=OFF ZP=ON
MOVE ALL 'HI' TO #W1(*)
MOVE 12 TO #W2(*)
REPEAT
INPUT 15T #N1 18T #N2
  IF #N1 = 0 THEN ESCAPE BOTTOM END-IF
  IF #N1 = 2 THEN PERFORM STOMSBB-CHECK-NEXT #W #W1(*) #W2(*) END-IF
END-REPEAT  
END  
