DEFINE DATA LOCAL
1 EMP VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 NAME
  2 SEX
  2 BIRTH
1 #B4 (B4)
1 REDEFINE #B4
  2 #ISN(P7)
END-DEFINE
SET KEY ALL
REPEAT
LIMIT 10
READ EMP BY NAME
  DISPLAY *ISN PERSONNEL-ID NAME SEX
END-READ
INPUT (AD=MI) 'ISN:' #ISN
IF *PF-KEY='PF3' ESCAPE BOTTOM END-IF
G1. GET EMP #B4
WRITE 'GET:' PERSONNEL-ID NAME SEX
END-REPEAT
WRITE 'END OF PROGRAM'  
END
