DEFINE DATA
LOCAL
1 #NUM(N9)
1 #NU1(N9)
1 #DEC(N7.2)
1 #DE1(N7.2)
1 #INT(I2)
1 #FLO(F4)
1 #ALFA(A10)
END-DEFINE
SET KEY ALL
REPEAT
INPUT (AD=MI) 'ENTER VALUES'
 /    #NUM #DEC #INT #FLO #ALFA
 /    'NUM PM=I' #NU1 (PM=I)
 /    'DEC MASK ZZ,Z99.99' #DE1 (EM=ZZZ,Z99.99)
IF *PF-KEY='PF3' ESCAPE BOTTOM END-IF
END-REPEAT
END
