DEFINE DATA LOCAL
1 EMPL VIEW OF EMPLOYEES
  2 &COL1
  2 &COL2
  2 &COL3
1 #CITY (A20)
END-DEFINE
INPUT #CITY
WRITE 'LIST EMPLOYEES FROM CITY:' #CITY
F1. FIND(20) EMPL WITH CITY = #CITY 
  DISPLAY &COL4 &COL-LIST
END-FIND
WRITE 'FIM DO PROGRAMA' *PROGRAM
END
