DEFINE DATA LOCAL
1 #WI(N3,3) INIT < 123,456 >
1 #WE(N7,0) INIT < 1234567 >
1 #A5(A5) INIT <'XXXXX'>
1 #O_D(P3,4) INIT < 123,4567 >
END-DEFINE
FORMAT(0) SG=ON ZP=ON LS=132 PS=0
WRITE(0) // '7' 2T '2' #A5
WRITE(0) 24T #O_D           (IS=ON)    
           34T #A5         (IS=ON)  
WRITE (0) 122T #A5 129T #A5
WRITE (0)
42T #WI
50T #WE
END
